IDEA StatiCa Open Model
ColumnData.ImperfectionDirection Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Gets or sets the direction of imperfection.
 Namespace: IdeaRS.OpenModel.Concrete
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public ImperfectionDirection ImperfectionDirection { get; set; }
Public Property ImperfectionDirection As ImperfectionDirection
	Get
	Set
public:
property ImperfectionDirection ImperfectionDirection {
	ImperfectionDirection get ();
	void set (ImperfectionDirection value);
}
Property Value
Type: ImperfectionDirection
See Also
Reference
ColumnData Class
IdeaRS.OpenModel.Concrete Namespace